Taptop - визуальный редактор кода для дизайнеров. Проект: разработка финансовой модели и инвестиционных материалов для привлечения раунда финансирования.
Вертикаль - крупная юридическая компании. Проект: сайзинг и анализ рынка специальных ситуаций, разработка стратегического позиционирования
Азимут - крупная сеть отелей. Проект: анализ туристического потенциала Калинградской области
Азимут - крупная сеть отелей. Проект: подготовка нескольких бизнес-планов строительства отелей в разных регионах. 
Сыры "Естественно" - дистрибутор молочной продукции. Проект: разработка финасовой модели и бюджета.
Casas Finance - испанская финансовая компания, предоставляющая услуги 
Агенство Креативных Индустрий. Проект: разработка концепции проекта Moscow fashion cluster
Harats - крупнейшая международная сеть пабов. Проект: разработка инвестиционных материалов для привлечения инвесторов.
Zaim Express - крупеная МФО. Проект: анализ и выбор новых стратегичесикх направлений. 
Moley Robotics - роботизированные кухни на рынке Великобритании. Проект: подготовка финансовых моделей, анализ рынка. 
Bitrobotics - один из лидеров в сфере роботизации пищевой промышленности. Проект: подготовка финансовой модели и инвестиционных материалов, анализ рынка. 
Русхлеб - крупный производитель хлебопекарных ингрединетов. Проект: разработка финансовой модели строительства завода. 
Palabra Ai - AI-перевод речи в реальном времени. Проект: анализ рынка и перспективных направлений развития.
Restate - крупный классифайд недвижимости. Проект: разработка финансовой модели и инвестиционной презентации для привлечения финансирования. 
АБЗ-1 - один из крупнейших производителей асфальто-бетона. Проект: сайзинг и анализ рынка асфальто-бетона.
Shiptor - логистическая платформа для электронной торговли. Проект: инвестиционная подготовка для продажи бизнеса. 
Silmar / MSC - международный оператор контейнерных перевозок. Проект: анализ и подготовка проекта по железнодорожных контейнерным перевозкам. 
STOKR - немецкая платформа для токенизации активов. Проект: подготовка финансовой модели 
АСНА - крупнейшая сеть независимых аптек. Проект: 
Велодрайв - крупнейшая специализированная сеть велосипедных магазинов. Проект: разработка стратегия развития, анализ и инвестиционная подготовка нескольких новых проектоа. 
МГМУ Сеченова. Проект: анализ рынка разработки новых лекарств и перпаратов.
ERG - крупнейший казахстанский холдинг в сфере добычи и переработки природных ресурсов. Проект: сайзинг и анализ рынка автозапчастей для спецтехники одного из дочерних предприятий группы.
РТРБ - инвестиционный фонд группы Ростех. Проекты: создание 
Ростех - крупнейшая промышленно-техолногическая группа. Проекты: ряд проектов в сфере анализа рынка, подготовки финансовых моделей и стратегий развития. 
Checkburo - сервис проверки автомобилей. Проект: инвестционная подготовка для продажи компаниии. 